PMo_manipulated/Graphviz/26.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "notify social\nsecurity" -> "ParallelGateway_2";
  "notify employer" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "receive confirmation\nfrom employer";
  "do\nmaternity/paternity\nleave" -> "decide if extend\nleave or return to\nwork";
  "decide if extend\nleave or return to\nwork" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "return to job";
  "StartNoneEvent" -> "ParallelGateway_3";
  "ParallelGateway_3" -> "fetch information\nabout financial\nsupport";
  "ParallelGateway_3" -> "fetch information\nabout leave models";
  "fetch information\nabout financial\nsupport" -> "ParallelGateway_4";
  "fetch information\nabout leave models" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "select appropriate\nmodel";
  "ExclusiveGateway_2" -> "apply for financial\nsupport";
  "apply for financial\nsupport" -> "ExclusiveGateway_3";
  "decide if apply for\nfinancial support" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_3";
  "receive confirmation\nfrom employer" -> "check if all\nnecessary documents\ngathered";
  "check if all\nnecessary documents\ngathered" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "do\nmaternity/paternity\nleave";
  "ParallelGateway_1" -> "notify employer";
  "ExclusiveGateway_4" -> "prepare necessary\ndocuments for leave";
  "ExclusiveGateway_3" -> "prepare necessary\ndocuments for leave";
  "prepare necessary\ndocuments for leave" -> "ParallelGateway_1";
  "select appropriate\nmodel" -> "decide if apply for\nfinancial support";
  "ExclusiveGateway_1" -> "prepare necessary\ndocuments for leave";
  "StartNoneEvent" -> "fetch information\nabout financial\nsupport";

  "StartNoneEvent" [label="", shape=circle];
  "return to job" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
}
